// Задание 1 
function showHello(text,name) {
    if (name === undefined) {
        name = 'Гость';
    }

    return alert();
}
const userName = prompt('Введите имя');
showHello("Привет", userName);



// Напишите функцию hello(), которая при вызове будет принимать переменную name (например, «Василий») и выводить строку (в нашем случае «Привет, Василий»).  В случае отсутствующего аргумента выводить «Привет, гость»
// Напишите функцию multiply(n,m), которая принимает два аргумента и возвращает произведение этих аргументов. Проверьте ее работу.
// Создайте функцию foo(a,b,с) оболочку для multiply(). foo() должна принимать три аргумента. Выводить в консоль результат  multiply() , Возвращать результат работы multiply() возведенный в степень с.
// Создайте функцию average() , которая будет находить среднее значение по всем своим аргументам (аргументы величины числовые).
